In [2]:
# Import Libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [3]:
# import customers dataframe

df_path='/Users/ryumugil/Downloads/CF/02-12-2025 Instacart Basket Analysis'

df_customers = pd.read_csv(os.path.join(df_path, '02 Data', 'Original Data','customers.csv'))

df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [4]:
#Rename fam_status to family status name without overwriting

df_customers.rename(columns = {'fam_status' : 'family status'}, inplace = True)

In [5]:
df_customers['family status'].value_counts(dropna = False)

family status
married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: count, dtype: int64

In [6]:
# Check for mixed types

for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].map(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

First Name

In [7]:
# Run a check for missing value in a dataframe

df_customers.isnull().sum()

user_id              0
First Name       11259
Surnam               0
Gender               0
STATE                0
Age                  0
date_joined          0
n_dependants         0
family status        0
income               0
dtype: int64

The method used is to check and find the missing values in the df_customers dataframe and some rows and columns are missing which is shown on the datafarame with dots which implies missing values.

In [9]:
df_customers_clean = df_customers[df_customers['n_dependants'].isnull()== False]
df_customers_clean.shape

(206209, 10)

In [10]:
# Address missing values in terms of how many rows and columns altogether addressed.

df_dups = df_customers_clean[df_customers_clean.duplicated()]

df_dups

Empty DataFrame
Columns: [user_id, First Name, Surnam, Gender, STATE, Age, date_joined, n_dependants, family status, income]
Index: []

In [11]:
# Combine the customers dataframe with prepared instacart data set.
# Merge customer data with orders on user_id
# Inspect the combined dataset

df_customers = pd.read_csv(os.path.join(df_path, '02 Data', 'Original Data','customers.csv'))

order_products = pd.read_csv(os.path.join(df_path, '02 Data', 'Original Data','orders.csv'))

combined_data = pd.merge(df_customers, order_products, on='user_id', how='left')

print(combined_data.head())

   user_id First Name    Surnam  Gender     STATE  Age date_joined  \
0    26711    Deborah  Esquivel  Female  Missouri   48    1/1/2017
1    26711    Deborah  Esquivel  Female  Missouri   48    1/1/2017
2    26711    Deborah  Esquivel  Female  Missouri   48    1/1/2017
3    26711    Deborah  Esquivel  Female  Missouri   48    1/1/2017
4    26711    Deborah  Esquivel  Female  Missouri   48    1/1/2017

   n_dependants fam_status  income  order_id eval_set  order_number  \
0             3    married  165665    518967    prior             1
1             3    married  165665    423547    prior             2
2             3    married  165665   2524893    prior             3
3             3    married  165665   2984525    prior             4
4             3    married  165665   2543867    prior             5

   order_dow  order_hour_of_day  days_since_prior_order
0          2                  9                     NaN
1          2                  9                    14.0
2          3                 11                    30.0
3          1                 17                    19.0
4          1                  9                    30.0

In [12]:
#Export combined_data merge dataframe as combined data.pkl in Prepared Data.

# this exports the newly created dataframe into combined data.pkl
combined_data.to_pickle(os.path.join(df_path, '02 Data', 'Original Data','combined_data.pkl'))

In [13]:
combine_data2 = pd.read_pickle(os.path.join(df_path, '02 Data', 'Original Data','combined_data.pkl'))

combine_data2.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income,order_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,518967,prior,1,2,9,NaN
1,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,423547,prior,2,2,9,14.0
2,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,2524893,prior,3,3,11,30.0
3,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,2984525,prior,4,1,17,19.0
4,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,2543867,prior,5,1,9,30.0